Repository: aimanzahar/ecopay
Catalog: lib/l10n/app_*.arb
Languages: ta

source: eWallet balance
ta: மின்-பணப்பை இருப்பு

source: Loading...
ta: ஏற்றுகிறது...

source: Reload
ta: மீண்டும் ஏற்று

source: Transaction History
ta: பரிவர்த்தனை வரலாறு

source: Scan
ta: ஸ்கேன்

source: Pay
ta: பணம் செலுத்து

source: Transfer
ta: மாற்று

source: Goals
ta: இலக்குகள்

source: Vouchers
ta: வௌச்சர்கள்

# oneReward
source: 1 Reward
ta: 1 வெகுமதி

# threeVouchers
source: 3 Vouchers
ta: 3 வௌச்சர்கள்

source: Highlights
ta: சிறப்பம்சங்கள்

source: Promotional Content
ta: விளம்பர உள்ளடக்கம்

source: Edit Balance
ta: இருப்பை திருத்து

# enterAmountToAdd
source: Enter the amount to add to your balance:
ta: உங்கள் இருப்பில் சேர்க்க வேண்டிய தொகையை உள்ளிடவும்:

source: Amount (RM)
ta: தொகை (RM)

source: Cancel
ta: ரத்து செய்

source: Add Balance
ta: இருப்பு சேர்

# pleaseEnterAmount
source: Please enter an amount
ta: தயவுசெய்து ஒரு தொகையை உள்ளிடவும்

# pleaseEnterValidNumber
source: Please enter a valid number
ta: தயவுசெய்து சரியான எண்ணை உள்ளிடவும்

# amountMustBeGreaterThanZero
source: Amount must be greater than 0
ta: தொகை 0-ஐ விட அதிகமாக இருக்க வேண்டும்

# amountCannotExceed
source: Amount cannot exceed RM 10,000
ta: தொகை RM 10,000-ஐ மீற முடியாது

source: 🌱 Welcome to EcoPay
ta: 🌱 EcoPay-க்கு வரவேற்கிறோம்

source: Your sustainable payment solution
ta: உங்கள் நிலையான கட்டண தீர்வு

# co2Saved
source: CO₂ Saved
ta: CO₂ சேமிப்பு

source: Transactions
ta: பரிவர்த்தனைகள்

source: My Contribution
ta: என் பங்களிப்பு

source: History
ta: வரலாறு

source: Gamification
ta: விளையாட்டாக்கம்

source: Leaderboard
ta: தலைமை பலகை

source: Challenges
ta: சவால்கள்

source: Achievements
ta: சாதனைகள்

source: EcoPayTree
ta: EcoPay மரம்

source: ESG Features
ta: ESG அம்சங்கள்

source: Environmental
ta: சுற்றுச்சூழல்

source: Social
ta: சமூக

source: Governance
ta: நிர்வாகம்

source: Carbon Footprint
ta: கார்பன் தடம்

source: This Month
ta: இந்த மாதம்

source: Calculate
ta: கணக்கிடு

# vsLastMonth
source: ↓ 23% vs last month
ta: ↓ கடந்த மாதத்துடன் ஒப்பிடும்போது 23%

source: Green Rewards
ta: பச்சை வெகுமதிகள்

# redeemPointsFor
source: Redeem points for sustainable products & services
ta: நிலையான பொருட்கள் & சேவைகளுக்காக புள்ளிகளை மீட்டெடு

source: Redeem
ta: மீட்டெடு

# pointsToNextReward
source: 253 points to next reward
ta: அடுத்த வெகுமதிக்கு 253 புள்ளிகள்

source: Sustainability Tips
ta: நிலைத்தன்மை குறிப்புகள்

source: Use digital receipts
ta: டிஜிட்டல் ரசீதுகளைப் பயன்படுத்தவும்

# saveUpToCO2
source: Save up to 2.5kg CO₂ per year
ta: ஆண்டுக்கு 2.5 கிலோ CO₂ வரை சேமிக்கவும்

source: Walk to nearby stores
ta: அருகிலுள்ள கடைகளுக்கு நடந்து செல்லவும்

# reduceTransportEmissions
source: Reduce transport emissions by 65%
ta: போக்குவரத்து உமிழ்வுகளை 65% குறைக்கவும்

source: Choose eco-friendly businesses
ta: சுற்றுச்சூழல் நட்பு வணிகங்களைத் தேர்வு செய்யவும்

source: Support sustainable practices
ta: நிலையான நடைமுறைகளை ஆதரிக்கவும்

source: Enable EcoPay
ta: EcoPay-ஐ இயக்கவும்

source: Activate EcoPay
ta: EcoPay-ஐ செயல்படுத்தவும்

# roundUpPayments
source: Round up your payments to support verified green projects. Track your CO₂ savings, earn rewards, and join a sustainability-driven community!
ta: சரிபார்க்கப்பட்ட பச்சை திட்டங்களை ஆதரிக்க உங்கள் கட்டணங்களை மேல்நோக்கி வளைக்கவும். உங்கள் CO₂ சேமிப்புகளைக் கண்காணிக்கவும், வெகுமதிகளைப் பெறவும், நிலைத்தன்மை சார்ந்த சமுதாயத்தில் சேரவும்!

source: Scan QR Code
ta: QR குறியீட்டை ஸ்கேன் செய்யவும்

# pointCameraAtQR
source: Point your camera at a DUITNOW QR code
ta: உங்கள் கேமராவை DUITNOW QR குறியீட்டில் காட்டவும்

# tapGalleryIcon
source: Or tap the gallery icon to select an image
ta: அல்லது படத்தைத் தேர்ந்தெடுக்க கேலரி ஐகானைத் தொடவும்

source: Processing QR Code...
ta: QR குறியீட்டை செயலாக்குகிறது...

source: Eco Leaderboard
ta: சுற்றுச்சூழல் தலைமை பலகை

source: Weekly
ta: வாராந்திர

source: Monthly
ta: மாதாந்திர

source: All Time
ta: எல்லா நேரமும்

source: Friends
ta: நண்பர்கள்

source: Current Rank
ta: தற்போதைய தரம்

source: Total Points
ta: மொத்த புள்ளிகள்

source: This Week
ta: இந்த வாரம்

source: Friends Beat
ta: நண்பர்களைத் தோற்கடித்தது

source: points
ta: புள்ளிகள்

source: Add Friends
ta: நண்பர்களைச் சேர்க்கவும்

source: Your Eco Achievements
ta: உங்கள் சுற்றுச்சூழல் சாதனைகள்

source: Unlocked
ta: திறக்கப்பட்டது

source: In Progress
ta: முன்னேற்றத்தில்

source: Categories
ta: வகைகள்

source: Completed
ta: நிறைவு

source: points earned
ta: புள்ளிகள் பெறப்பட்டன

source: Bronze
ta: வெண்கலம்

source: Silver
ta: வெள்ளி

source: Gold
ta: தங்கம்

source: Platinum
ta: பிளாட்டினம்

source: Diamond
ta: வயிரம்

source: EcoPay Assistant
ta: EcoPay உதவியாளர்

source: Powered by Trees 🌱
ta: மரங்களால் இயக்கப்படுகிறது 🌱

source: Offline mode 🌱
ta: ஆஃப்லைன் பயன்முறை 🌱

source: Language
ta: மொழி

source: Select Language
ta: மொழியைத் தேர்ந்தெடுக்கவும்

source: Language Settings
ta: மொழி அமைப்புகள்

source: Changing Language...
ta: மொழியை மாற்றுகிறது...

# languageChanged
source: Language changed successfully!
ta: மொழி வெற்றிகரமாக மாற்றப்பட்டது!

source: Selected
ta: தேர்ந்தெடுக்கப்பட்டது

# englishDescription
source: English (International)
ta: English (சர்வதேசம்)

# malayDescription
source: Bahasa Melayu (Malaysia)
ta: Bahasa Melayu (மலேசியா)
